       IDENTIFICATION                  DIVISION.    
       PROGRAM-ID. PROG001.                         
       ENVIRONMENT                     DIVISION.    
       DATA                            DIVISION.    
       WORKING-STORAGE                 SECTION.     
       PROCEDURE                       DIVISION.    
           DISPLAY 'DENISE   PROGRAMA'.             
           STOP RUN.                                